<?php
$ict_ex = "";

?>
<div>
    <h1>高度ICT演習：ばすうぃふと</h1>
    <p>
        有志の活動である高度ICT演習では、函館バスの経路検索アプリを作るチーム「ばすうぃふと」に
        1年生の頃から参加しています。<br>
        iOS班、Android班、バックエンド班、デザイン班があり、1,2年生の時はバックエンド班に所属していました。<br>
        3年からはAndroid班に所属しています。
    </p>

    <div class="box">

        <div class="card" style="background:#ff6347;">
            <p>バックエンド班</p>
            <p>使用言語：Go</p>
            <p>
                担当した主な作業：<br>
                1. 検索の優先度変更実験<br>
                2. 運賃計算<br>
                3. アルゴリズムの変更実験（ダイクストラ→CSA　2人で作業）<br>
                4. バス停名入力時の予測変換用JSONデータ作成<br>
            </p>
        </div>

        <div class="card" style="background:#ff6347;">
            <p>Android班</p>
            <p>使用言語：Kotlin</p>
            <p>
                以前のAndroid班の人から引き継ぎ、2人で再スタートのため勉強中
            </p>
        </div>

        <div class="card" style="background:#ff6347;">
            <p>発表・イベント</p>
            <p>
                1年生の頃から全発表会・イベントに参加中
            </p>
            <p>
                1. 前期成果発表会・後期成果発表会<br>
                2. オープンキャンパス<br>
                3. アカデミックリンク<br>
                4. プロジェクト学習成果発表会@東京<br>
                5. お悩みざっそう会（2024年度）<br>
                6. デザインワークショップ（2025年度）<br>
            </p>
            <p>

            </p>
        </div>
    </div>
</div>